C4.org
#+TITLE: C4 Configuration
#+DATE: 2021-01-23
#+AUTHOR: Chatman R. Jr
:PROPERTIES:
:header-args: :mkdirp yes
:END:

* Summary

This configuration builds off my experience with [[https://github.com/hlissner/doom-emacs][Doom Emacs]], and is heavily informed by code from
the [[https://github.com/daviwil/emacs-from-scratch][Emacs from Scratch project]]. It's my personal configuration/Emacs Lisp study reference as I learn.

C4 is a middle ground between vanilla Emacs (which isn't all that useful for me by itself) and whole
batteries-included frameworks and distributions (such as Doom Emacs and Spacemacs).

It does just enough.

C4 is based on my real day to day needs and prioritizes ease, convenience and performance. If any
included functionality doesn't add value to my workflow, it's gone. Like that.

* Initialization

  C4 is a module-based configuration, so the very first thing it does is load in its own modules.

#+BEGIN_SRC emacs-lisp :tangle "./early-init.el"
(require 'cl-lib)

(require 'preamble
          (concat user-emacs-directory "modules/preamble.el"))
(require 'base
          (concat user-emacs-directory "modules/base.el"))
(require 'keybindings
          (concat user-emacs-directory "modules/keybindings.el"))
(require 'projects
          (concat user-emacs-directory "modules/projects.el"))
(require 'code
          (concat user-emacs-directory "modules/code.el"))
(require 'documents
          (concat user-emacs-directory "modules/documents.el"))
(require 'desktop
          (concat user-emacs-directory "modules/desktop.el"))
#+END_SRC

* Modules

** Preamble

The =preamble.el= module contains a few defaults and performance optimizations that should be done
before anything else happens.

*** ~c4/perf~

The first optimization involves increasing the Emacs garbage collection threshold to 100MB on
startup. This gives a slight boost in initialization. After Emacs starts up, we use a hook to reduce
the threshold back to its approximate initial state.

#+NAME: c4/perf
#+BEGIN_SRC emacs-lisp :tangle "./modules/preamble.el"
(defun c4/perf ()
  "Handles performance optimizations"

  ;; Raise the garbage collection threshold high as emacs starts
  (setq gc-cons-threshold 100000000)
  (setq read-process-output-max (* 1024 1024))

  ;; Drop it down once loaded
  (add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 1000000))))
#+END_SRC

*** ~c4/packages-setup~

Next, we handle all package management with [[https://github.com/raxod502/straight.el][straight.el]] and package configuration with
[[https://github.com/jwiegley/use-package][use-package]]. This configuration *does not use package.el at all*.

#+BEGIN_SRC emacs-lisp :tangle "./modules/preamble.el"

(defun c4/packages-setup ()
  "Initializes package management with straight.el & use-package."
  ;; Initialize straight.el for package management
  (setq straight-repository-branch "develop")
  (defvar bootstrap-version)
  (let ((bootstrap-file
        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
            "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
            'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; use-package integration
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t))

#+END_SRC

*** ~c4/housekeeping~

Finally, we set a few helpful variables to inhibit lockfiles. I also disable custom files simply
because I prefer doing all of my configuration in Emacs-Lisp. Next, I add a hook to delete trailing
whitespace in my files.

There's a helper function to tell Emacs to create directories that don't exist on the filesystem for
convenience. And last but not least, [[https://github.com/emacscollective/no-littering][no-littering]] helps keep the configuration files separate from
files that Emacs may create via its packages.

In addition, it tells Emacs to keep all autosaves (which can help in a pinch) in their own directory
instead of dropping them wherever.

#+BEGIN_SRC emacs-lisp :tangle "./modules/preamble.el"

(defun c4/housekeeping ()
  "A helper for should-be-defaults"
  ;; Lockfiles do more harm than good
  (setq create-lockfiles nil)

  ;; Custom files just add clutter
  (setq custom-file null-device)

  (add-hook 'before-save-hook
    'delete-trailing-whitespace)    ; Delete trailing whitespace on save

  ;; Create parent dirs when opening new files
  (add-to-list 'find-file-not-found-functions #'c4/create-parent-on-file-find)

  ;; I really don't like clutter. Really :P
  (use-package no-littering
  :custom
  (auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))))

(defun c4/create-parent-on-file-find ()
  "Ensures that the parent dirs are created for a nonexistent file."
  (let ((parent-directory (file-name-directory buffer-file-name)))
    (when (and (not (file-exists-p parent-directory))
                (y-or-n-p (format
                          "Directory `%s' does not exist! Create it?"
                          parent-directory)))
      (make-directory parent-directory t))))

(provide 'preamble)
#+END_SRC

And then we call the module functions in our =init.el=.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(c4/perf)
(c4/packages-setup)
(c4/housekeeping)

#+END_SRC

** Base

The =base.el= module sets the /baseline/ experience that C4 is intended to provide without any of
its other enhancements. This includes:

+ setting the user
+ setting the theme
+ setting the typography (code and document)
+ essential UX enhancements

*** ~c4/user~

This function sets the user identity.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"
(cl-defun c4/user (&key name email)
  "Define user identity."
  (setq user-full-name name
          user-full-email email))

#+END_SRC

And it's used in =init.el= like so:

#+BEGIN_SRC emacs-lisp :tangle "./init.el"

(c4/user
  :name "Chatman R. Jr"
  :email "crjr.code@protonmail.com")

#+END_SRC

*** ~c4/base~

This module is exposed to our =init.el= to create our settings for the base look and feel and also
some essential functionality. It's composed of the =ui= and =ux= modules that follow below.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"
(cl-defun c4/base (&key theme typography)
  (eval (c4/ui theme typography))
  (c4/ux))
#+END_SRC

We assemble it in our =init.el= like this:

#+BEGIN_SRC emacs-lisp :tangle "./init.el"

(c4/base
  :theme 'minimal-light
  :typography
  (c4/typography
    :code '("Input" 12)
    :document '("Lora" 14)))

#+END_SRC

*** ~c4/ui~

Now, we set the base UI. It accepts a theme and typography settings from the submodules documented
below.  It also sets basic options that go a long way toward making the Emacs UI look halfway decent.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/ui (theme typography)
  "A module for the base UI."
  (setq-default cursor-type 'bar) ; default cursor as bar
  (setq-default frame-title-format '("%b")) ; window title is the buffer name

  (setq linum-format "%4d ") ; line number format
  (column-number-mode 1)
  (show-paren-mode 1) ; show closing parens by default

  (menu-bar-mode -1) ; disable the menubar
  (scroll-bar-mode -1) ; disable visible scroll bar
  (tool-bar-mode -1) ; disable toolbar
  (tooltip-mode -1) ; disable tooltips
  (set-fringe-mode 8) ; allow some space

  ;; Show line numbers in programming modes
  (add-hook 'prog-mode-hook
            (if (and (fboundp 'display-line-numbers-mode) (display-graphic-p))
                #'display-line-numbers-mode
              #'linum-mode))


  ;; Disable for document and terminal modes
  (dolist (mode '(
      org-mode-hook
      term-mode-hook
      shell-mode-hook
      treemacs-mode-hook
      vterm-mode
      eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Tidy up the modeline
  (use-package diminish)
  ;; And let's make it a bit sexier
  (use-package all-the-icons)

  (eval (c4/theme theme))
  (eval typography))

#+END_SRC

This is a good time to mention that C4 also contains internal modules for composing functionality
across its main modules. These submodules can be swapped in and out as needed without issue.

The UI base uses =c4/theme= and =c4/typography= submodules. Which I'll explain now.

**** ~c4/theme~

The theme submodule sets up the mode line with [[https://github.com/Malabarba/smart-mode-line][the smart-mode-line package]]. I know a lot of
configurations swear by the Doom Emacs mode line, but I wanted something lighter.

It also checks and installs a subset of themes based on the prefix of the themes passed in. Right
now, the themes supported are the [[https://gitlab.com/protesilaos/modus-themes][modus]], [[https://github.com/hlissner/emacs-doom-themes][Doom]], and [[https://github.com/anler/minimal-theme][minimal]] (the default) collections. As well as the built-in themes
that ship with Emacs.

The last thing it does is disable the fringe background for that extra bit of crispness.

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/theme (theme)
  "A submodule for setting a theme and configuring the modeline."
  (setq theme-sym (symbol-name theme))

  (use-package smart-mode-line
    :custom
    (sml/theme 'respectful)
    (sml/no-confirm-load-theme t)
    (sml/name-width 64)
    (sml/mode-width 'full)
    :config
    (sml/setup)
    (add-to-list 'sml/replacer-regexp-list '("^~/.config/emacs/" ":C4:") t)
    (add-to-list 'sml/replacer-regexp-list '("^~/Workbench/" ":Code:") t)
    (add-to-list 'sml/replacer-regexp-list '("^~/Org/" ":Org:") t))

  (cond ((string-prefix-p "modus" theme-sym)
	 (use-package modus-themes
	   :config
	   (load-theme theme t)))
  ((string-prefix-p "minimal" theme-sym)
    (use-package minimal-theme
      :config (load-theme theme t)))
	((string-prefix-p "doom" theme-sym)
	 (use-package doom-themes
	   :config (load-theme theme t)))
	  (t (load-theme theme t)))

  (set-face-attribute 'fringe nil :background nil))

#+END_SRC


**** ~c4/typography~

This submodule defines typography settings for the UI. It allows you to set the fixed pitch (which
is also the default font) as well as the variable pitch (for Org and other document modes).

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

  (cl-defun c4/typography (&key code document)
    "A module for setting typography."
    (set-face-attribute 'default nil
      :font (format "%s-%s:slant=normal" (car code) (cadr code)))
    (set-face-attribute 'fixed-pitch nil
      :font (format "%s-%s" (car code) (cadr code)))
    (set-face-attribute 'variable-pitch nil
      :font (format "%s-%s" (car document) (cadr document))))

#+END_SRC

*** ~c4/ux~

The base UX module that sets some defaults to prevent Emacs from getting on your nerves before your
really start appreciating it. This includes:

+ inhibiting the startup message
+ beginning with a blank scratch
+ no error beeping
+ sensible autosaving
+ "y" or "n" prompting

  And the packages:

+ [[https://github.com/justbur/emacs-which-key][which-key]]: a necessity for discovering the default and custom keybindings throughout this configuration
+ [[https://github.com/Wilfred/helpful][helpful]]: provides a much more useful help interface
+ [[https://github.com/editorconfig/editorconfig-emacs][editorconfig]] plugin for Emacs: to keep style definitions where they belong
+ [[https://github.com/akermu/emacs-libvterm][vterm]]: a rich terminal so I don't have to leave Emacs for my sysadmin flow

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/ux ()
  "A module for the 'base' UX."
  (setq inhibit-startup-message t) ; inhibit startup message
  (setq initial-scratch-message "") ; no scratch message
  (setq visible-bell t)             ; enable visual bell
  (global-auto-revert-mode t) ; autosave buffer on file change
  (delete-selection-mode 1) ; Selected text will be overwritten on typing
  (fset 'yes-or-no-p 'y-or-n-p) ; convert "yes" or "no" confirms to "y" and "n"

  ;; See a database of all defined keybindings
  (use-package which-key
    :init
    (setq which-key-idle-delay 0.96)
    :diminish
    :config
    (which-key-mode))

  ;; Better help documentation
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

  ;; Editorconfig
  (use-package editorconfig
    :diminish
    :config
    (editorconfig-mode))

  ;; Better terminal
  (use-package vterm)

  (c4/lookup))

#+END_SRC

**** ~c4/lookup~

The UX base includes a single submodule for defining valuable search and sorting functionality using
the [[https://github.com/abo-abo/swiper][ivy ecosystem]] of packages. These include:

+ swiper: incremental buffer searching
+ ivy itself: better minibuffer completion
+ counsel: provides a richer experience in Emacs interactive prompts
+ [[https://github.com/Yevgnen/ivy-rich][ivy-rich]]: provides more contextual information in the minibuffer
+ [[https://github.com/raxod502/prescient.el][ivy-prescient]]: sorts your commands by usage

#+BEGIN_SRC emacs-lisp :tangle "./modules/base.el"

(defun c4/lookup ()
  "A module for search functionality."
  ;; Incremental search
  (use-package swiper)

  ;; Lookup enhancements
  (use-package ivy
    :diminish
    :custom
    (ivy-initial-inputs-alist nil) ; no ^ before searches
    :bind
    (("C-s" . swiper)
    ("C-r" . swiper-backward)
    :map ivy-minibuffer-map
    ("TAB" . ivy-alt-done)
    ("C-l" . ivy-alt-done)
    ("C-j" . ivy-next-line)
    ("C-k" . ivy-previous-line)
    :map ivy-switch-buffer-map
    ("C-k" . ivy-previous-line)
    ("C-l" . ivy-done)
    ("C-d" . ivy-switch-buffer-kill)
    :map ivy-reverse-i-search-map
    ("C-k" . ivy-previous-line)
    ("C-d" . ivy-reverse-i-search-kill)))

  (use-package counsel
    :diminish
    :bind
    (("C-x b" . counsel-ibuffer)
    ("C-M-j" . counsel-switch-buffer)
    :map minibuffer-local-map
    ("C-x r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

  (use-package ivy-rich
    :after (ivy counsel)
    :config
    (ivy-rich-mode))

  ;; Command sorting recent
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1)))

(provide 'base)
#+END_SRC

** Keybindings

C4 takes a lot of inspiration from Doom and Spacemacs for its keybindings. For one, it's [[https://github.com/emacs-evil/evil][evil to the
bone]]. Ergonomic keybindings and modal editing are good ideas that will save my hands and wrists in
the long run.

#+BEGIN_QUOTE
That said, I do have my own ideas toward that end which won't necessarily require evil-mode. They are
very much just inklings at the moment.
#+END_QUOTE

*** ~c4/keybindings~

The keybindings are exposed via a top level module. It's composed of three submodules.

#+BEGIN_SRC emacs-lisp :tangle "./modules/keybindings.el"
(defun c4/keybindings ()
  (c4/evil)
  (c4/transient)
  (c4/mnemonics))

#+END_SRC

And then it's served in our =init.el=.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"

(c4/keybindings)

#+END_SRC

