C4.org
*** ~c4/org~

This is a top-level module exposed by =documents.el= It wraps all of the submodule Org Mode settings
under a common interface for =init.el=.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"
  (cl-defun c4/org (&key path)
    (use-package org
      :straight org-plus-contrib
      :init
      (setq org-ellipsis " ↴")
      (setq org-directory path)
      (c4/org-agenda)
      (c4/org-templates)
      (c4/org-babel)
      :config
      (c4/org-theme)
      (advice-add 'org-refile :after 'org-save-all-org-buffers)
      :hook
      (org-mode . c4/org-init)))

#+END_SRC

Now, we call in it =init.el=.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"

(c4/org :path "~/Org")

#+END_SRC

**** ~c4/org-init~

A submodule that defines the absolute basic settings for Org Mode whenever an Org buffer opens.

By default I want automatically indent content under Org headings, enable variable pitch so I can
use my document font, and ensure my text will wrap at the right line length.

Packages in use:

+ [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]]: wraps visual line mode buffers at a given line length and provides the option
  to center the buffer

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-init ()
  (org-indent-mode 1)
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  (auto-fill-mode 1)

  (use-package visual-fill-column
    :defer t
    :custom
    (visual-fill-column-width 100)
    (visual-fill-column-center-text t)
    :hook (org-mode . visual-fill-column-mode)))

#+END_SRC

**** ~c4/org-theme~

A submodule that performs some UI tweaks for Org buffers. Mainly, it resets certain faces to the
code font and makes the bullets look proper.

Packages in use:

+ [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]]: make your Org headings /fancy/

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-theme ()
  (set-face-attribute 'org-block nil
    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-end-line nil
    :foreground nil :weight 'normal :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))

  (use-package org-superstar
    :diminish
    :after org
    :hook
    (org-mode . org-superstar-mode)
    :custom
    (org-superstar-headline-bullets-list
      '("§" "☙" "჻" " " " " " " " "))))

#+END_SRC

**** ~c4/org-agenda~

This submodule sets up the Org agenda flow for creating task lists and project planning.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-agenda ()
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (setq org-agenda-files
    '("Tasks.org" "Projects.org"))

  (setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
        (sequence
          "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)"
          "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  (setq org-refile-targets
    '(("Archive.org" :maxlevel . 1)
        ("Tasks.org" :maxlevel . 1)))

  (setq org-tag-alist
    '((:startgroup)
        ("@product" . ?P)
        ("@experiment" . ?E)
        ("@resource" . ?R)
        ("@learning" . ?L)
        ("@teaching" . ?T)
        (:endgroup)
        ("prototyping" . ?p)
        ("developing" . ?d)
        ("documenting" . ?D)
        ("testing" . ?t)
        ("refactoring" . ?r)))

  (setq org-agenda-custom-commands
    '(("d" "Dashboard"
        ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
            ((org-agenda-overriding-header "Next Tasks")))))

        ("P" "Products" tags-todo "@product")
        ("E" "Experiments" tags-todo "@experiment")
        ("R" "Resources" tags-todo "@resource")
        ("L" "Learning" tags-todo "@learning")
        ("T" "Teaching" tags-todo "@teaching")

        ("s" "Workflow Status"
          ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
              (org-agenda-files org-agenda-files)))
          (todo "REVIEW"
            ((org-agenda-overriding-header "Under Review")
              (org-agenda-files org-agenda-files)))
          (todo "PLAN"
            ((org-agenda-overriding-header "Planning")
              (org-agenda-files org-agenda-files)))
          (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
              (org-agenda-files org-agenda-files)))
          (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
              (org-agenda-files org-agenda-files)))
          (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
              (org-agenda-files org-agenda-files)))
          (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
              (org-agenda-files org-agenda-files)))
          (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
              (org-agenda-files org-agenda-files))))))))

#+END_SRC

**** ~c4/org-templates~

This submodule sets up Org capture templates for scaffolding a new task and other TBD templating
needs.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-templates ()
  (setq org-capture-templates
    `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "Tasks.org" "Inbox")
          "* TODO %?\n %U\n %a\n %i" :empty-lines 1))))

#+END_SRC

**** ~c4/org-babel~

This submodule configures source block tangling and execution. It also defines the languages to
allow for a literate programming workflow.

#+BEGIN_SRC emacs-lisp :tangle "./modules/documents.el"

(defun c4/org-babel ()
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (js . t)))

  (setq org-src-fontify-natively t)
  (setq org-confirm-babel-evaluate nil))


(provide 'documents)
#+END_SRC

** Desktop

As I stated earlier, Emacs is the driver of my desktop computing experience.

Therefore, the final piece in my Emacs configuration is EXWM. Using Emacs as my window manager
brings several advantages:

+ A unified desktop interface
+ Less context switching
+ A window manager as flexible and extensible as Emacs itself
+ Enforced focus on my work environment

I'm aware this approach isn't for everyone, and I wouldn't use it myself if I didn't trust the
stability of Emacs as software. If you have trepidations, you can disable the entire desktop module
and everything else will still work.

#+BEGIN_QUOTE
EXWM only works on Linux systems, though.
#+END_QUOTE

*** Setup

To actually use Emacs as my desktop environment, I need to create a =.xinitrc=.

#+BEGIN_SRC sh :tangle "~/.xinitrc"
# Caps to CTRL
setxkbmap -option ctrl:nocaps

# Disable touchpad
xinput set-prop 12 "Device Enabled" 0

# Default cursor
xsetroot -cursor_name left_ptr

# Xresources
xrdb ~/.Xresources

# Settings
gnome-settings-daemon &

# Autostart programs
dex -a

# Removable media
udiskie &

# Notifications
dunst &

# Start EXWM
exec dbus-launch --exit-with-session emacs -mm --debug-init
#+END_SRC

I also used software (ARandR) to configure my multi-monitor setup.

#+BEGIN_SRC sh :tangle "./desktop/multihead.sh"
#!/bin/sh
xrandr --output LVDS --primary --mode 1366x768 --pos 241x1080 --rotate normal --output VGA-0 --off --output HDMI-0 --mode 1920x1080 --pos 0x0 --rotate normal
#+END_SRC

*** ~c4/desktop~

This is the top level module that =desktop.el= exposes. It wraps all the desktop definition
submodules that are documented below.

#+BEGIN_SRC emacs-lisp :tangle "./modules/desktop.el"
    (defun c4/desktop ()
      "A module for my EXWM configuration."
      (use-package exwm
        :if window-system
        :diminish
        :config
        ;; Startup process
        (start-process-shell-command
          "nitrogen" nil "nitrogen --restore")

        (display-time-mode t)

        (setq exwm-workspace-number 6)
        (setq display-time-default-load-average nil)
        (setq exwm-workspace-warp-cursor t)
        (setq focus-follows-mouse t)

        (setq exwm-input-prefix-keys
              '(?\C-x
                ?\C-u
                ?\C-h
                ?\M-x
                ?\M-`
                ?\M-&
                ?\M-:
                ?\s-\ ))

        (setq exwm-input-global-keys
              `(([?\s-K] . windmove-swap-states-up)
                ([?\s-k] . windmove-up)
                ([?\s-L] . windmove-swap-states-right)
                ([?\s-l] . windmove-right)
                ([?\s-J] . windmove-swap-states-down)
                ([?\s-j] . windmove-down)
                ([?\s-H] . windmove-swap-states-left)
                ([?\s-h] . windmove-left)
                ([?\s-r] . exwm-reset)
                ([?\s-Q] . exwm-exit)
                ([?\s-q] . exwm-restart)
                ([?\s-W] . exwm-workspace-swap)
                ([?\s-w] . exwm-workspace-switch)
                ([?\s-D] . counsel-linux-app)
                ([?\s-d] . (lambda (cmd)
                              (interactive (list (read-shell-command "$ ")))
                              (start-process-shell-command cmd nil cmd)))
                ,@(mapcar (lambda (i)
                            `(,(kbd (format "s-%d" i)) .
                              (lambda ()
                                (interactive)
                                (exwm-workspace-switch-create ,i))))
                          (number-sequence 0 9))))

        (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

        ;; Update window class with the buffer name
        (add-hook 'exwm-update-class-hook #'c4/exwm-update-class)

        (require 'exwm-randr)
        (setq exwm-randr-workspace-monitor-plist
              '(0 "LVDS" 2 "LVDS" 4 "LVDS" 1 "HDMI-0" 3 "HDMI-0" 5 "HDMI-0"))
        (start-process-shell-command "xrandr" nil
                                      (concat user-emacs-directory "desktop/multihead.sh"))
        (exwm-randr-enable)

        (require 'exwm-systemtray)
        (setq exwm-systemtray-height 16)
        (exwm-systemtray-enable)

        (exwm-enable))

      ;; EXWM: Desktop Environment
      (use-package desktop-environment
        :after exwm
        :diminish
        :bind
        ("s-l" . windmove-right)
        :config
        (desktop-environment-mode)))

    (defun c4/exwm-update-class ()
      (exwm-workspace-rename-buffer exwm-class-name))

  (provide 'desktop)
#+END_SRC

Finally, we add it to =init.el=.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"

(c4/desktop)
#+END_SRC
